(function() {
	"use strict";
var ikData = {
	"tiks": [
		{
			"lon": 39.78681015,
			"lat": 57.685742225,
			"desc": "ТИК Дзержинского района, Ленинградский пр-т, 50. (4852) 40-94-50",
			"url": "http://www.yaroslavl.vybory.izbirkom.ru/region/yaroslavl?action=show_komissia&region=76&sub_region=76&type=100&sortMode=atd&vrnorg=276200070662&vrnkomis=476401800484",
			"name": "Дзержинский"
		},
		{
			"lon": 39.9343344,
			"lat": 57.65157545,
			"desc": "ТИК Заволжского района, проспект Авиаторов, 74а. (4852) 409789",
			"url": "http://www.yaroslavl.vybory.izbirkom.ru/region/yaroslavl?action=show_komissia&region=76&sub_region=76&type=100&sortMode=atd&vrnorg=276200070672&vrnkomis=476401891840",
			"name": "Заволжский"
		},
		{
			"lon": 39.87883145,
			"lat": 57.62848255,
			"desc": "ТИК Кировского района города, Республиканская, 49. (4852) 40-92-03",
			"url": "http://www.yaroslavl.vybory.izbirkom.ru/region/yaroslavl?action=show_komissia&region=76&sub_region=76&type=100&sortMode=atd&vrnorg=276200070676&vrnkomis=476401987547",
			"name": "Кировский"
		},
		{
			"lon": 39.871819,
			"lat": 57.60918,
			"desc": "ТИК Красноперекопского района, Большая Федоровская, 43. (4852) 40-44-00",
			"url": "http://www.yaroslavl.vybory.izbirkom.ru/region/yaroslavl?action=show_komissia&region=76&sub_region=76&type=100&sortMode=atd&vrnorg=276200070680&vrnkomis=476402087696",
			"name": "Красноперекопский"
		},
		{
			"lon": 39.87169835,
			"lat": 57.60924145,
			"desc": "ТИК Ленинского района, Советская, 80. (4852) 40-90-04, 40-90-35",
			"url": "http://www.yaroslavl.vybory.izbirkom.ru/region/yaroslavl?action=show_komissia&region=76&sub_region=76&type=100&sortMode=atd&vrnorg=276200070684&vrnkomis=476402177368",
			"name": "Ленинский"
		},
		{
			"lon": 39.8737579,
			"lat": 57.5981695,
			"desc": "ТИК Фрунзенского района, Московский пр-т, 107. (4852) 40-92-49 40-92-44",
			"url": "http://www.yaroslavl.vybory.izbirkom.ru/region/yaroslavl?action=show_komissia&region=76&sub_region=76&type=100&sortMode=atd&vrnorg=276200070688&vrnkomis=476402295481",
			"name": "Фрунзенский"
		}
	],
	"uiks": [
		{
			"lon": 39.767342,
			"lat": 57.731113,
			"desc": "Красноперевальский пер., д. 4 школа №17",
			"name": "1, 2",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.779381,
			"lat": 57.718632,
			"desc": "Б. Любимская, д.71 школа №60",
			"name": "3",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.7758525,
			"lat": 57.71355625,
			"desc": "ул. 1905 года, д. 6 МУ «Ярославльобщежитие»",
			"name": "4",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.79412035,
			"lat": 57.70030845,
			"desc": "Тутаевское шоссе, д. 74 Ярославский учебный центр Северной железной дороги ОАО «РЖД»",
			"name": "5",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.79866125,
			"lat": 57.69173685,
			"desc": "ул. Блюхера, д.74 школа №26",
			"name": "6, 7, 8, 9",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.81121965,
			"lat": 57.6851977,
			"desc": "ул. Блюхера, д.32 а школа №81",
			"name": "10, 11",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.833893,
			"lat": 57.673985,
			"desc": " Тутаевское, д.13 ГОУ НПО ЯО Профессиональное училище № 11",
			"name": "12",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.807159,
			"lat": 57.682232,
			"desc": "ул. Е.Колесовой, д.26 школа №72",
			"name": "13, 14",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.802525,
			"lat": 57.680408,
			"desc": "ул. Е.Колесовой, д.38 школа №80",
			"name": "15, 16",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.796246,
			"lat": 57.685589,
			"desc": "ул. Урицкого, д.32 а школа №39",
			"name": "17, 18, 19, 20",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.785076,
			"lat": 57.67926,
			"desc": "ул. Труфанова, д. 4 школа №27",
			"name": "21, 22, 23",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.78793,
			"lat": 57.674934,
			"desc": "ул. Е. Колесовой, д. 70 ФГБОУ ВПО Ярославская государственная сельскохозяйственная академия (агрофак",
			"name": "24, 25",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.779476,
			"lat": 57.674366,
			"desc": "ул. Громова, д. 10 а школа №11",
			"name": "26, 27, 28, 29",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.778049,
			"lat": 57.684628,
			"desc": "Ленинградский пр., д. 87 гимназия № 2",
			"name": "30, 31",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.774982,
			"lat": 57.682823,
			"desc": "ул. Труфанова, д. 16 школа №62",
			"name": "32, 33",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.765755,
			"lat": 57.69173,
			"desc": "ул. Туманова, д. 18в школа №10",
			"name": "34, 35, 36",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.76775,
			"lat": 57.69054,
			"desc": "ул. Туманова, д. 10в школа №5",
			"name": "37, 38, 39",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.79203,
			"lat": 57.688152,
			"desc": "пр. Дзержинского, д. 21 ГОАУ ДОД ЯО Центр детей и юношества",
			"name": "40",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.777119,
			"lat": 57.695507,
			"desc": "Ленинградский пр., д. 64 а школа №90",
			"name": "41, 47, 48, 49, 50",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.772942,
			"lat": 57.697021,
			"desc": "Ленинградский пр., д. 68 школа №87",
			"name": "42, 43, 44, 45, 46",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.770325,
			"lat": 57.678257,
			"desc": "Архангельский пр., д.13 школа №29",
			"name": "51, 52, 53",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.766655,
			"lat": 57.679977,
			"desc": "ул. Громова, д.36 школа №55",
			"name": "54, 55, 56",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.761463,
			"lat": 57.685856,
			"desc": "ул. Труфанова, д.21 а школа №58",
			"name": "57, 58, 59",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.758846,
			"lat": 57.687267,
			"desc": "ул. Труфанова, д.25а школа №34",
			"name": "60, 61, 62",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.763256,
			"lat": 57.705627,
			"desc": " ул. Строителей, д. 21 Центр дополнительного образования МОУ средней общеобразовательной школы № 56",
			"name": "63, 64, 65, 66, 67, 68",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.817413,
			"lat": 57.682655,
			"desc": "Тутаевское шоссе, д. 31в ГБУЗ ЯО Областной перинатальный центр",
			"name": "69",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.783978,
			"lat": 57.703796,
			"desc": "ул. Тутаевское шоссе, д. 95 МУЗ Клиническая больница № 9",
			"name": "70",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.781033,
			"lat": 57.702297,
			"desc": "ул. Тутаевское шоссе, д. 95а ГБУЗ ЯО Областной кожно-венерологический диспансер",
			"name": "71",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.820545,
			"lat": 57.682919,
			"desc": "ул. Тутаевское шоссе, д. 31 МКУЗ Медсанчасть ОАО «Автодизель»",
			"name": "72",
			"tikName": "Дзержинский"
		},
		{
			"lon": 39.904884,
			"lat": 57.640209,
			"desc": "станция Урочь, д.10 школа №97",
			"name": "73",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.910686,
			"lat": 57.630493,
			"desc": "Тверицкая набережная, д.58а межшкольный учебный комбинат № 1",
			"name": "74",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.91761,
			"lat": 57.644478,
			"desc": "проспект Авиаторов, д.37 школа №50",
			"name": "75",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.923779,
			"lat": 57.63905,
			"desc": "улица Маяковского, д.17а школа №46",
			"name": "76",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.945709,
			"lat": 57.62553,
			"desc": "улица Маяковского, д.63 Ярославский областной геронтологический центр",
			"name": "77",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.926151,
			"lat": 57.621639,
			"desc": "улица Союзная, д.141 общежитие Ярославского государственного университета им.П.Г.Демидова",
			"name": "78",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.954967,
			"lat": 57.606602,
			"desc": "ул.Клубная, д.19 Дом культуры «Энергетик»",
			"name": "79, 80",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.979382,
			"lat": 57.609177,
			"desc": " улица&nbsp; Клубная, д.62 школа №51",
			"name": "81, 82",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.940437,
			"lat": 57.652332,
			"desc": "проспект Авиаторов, д.84 школа №2",
			"name": "83, 84, 85",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.949177,
			"lat": 57.645699,
			"desc": " улица&nbsp; Саукова, д.13 школа №52",
			"name": "86, 87",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.94529,
			"lat": 57.644413,
			"desc": " улица Саукова, д.5 гимназия&nbsp; № 3",
			"name": "88, 89, 90",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.953102,
			"lat": 57.642113,
			"desc": " улица Папанина, д.10а школа&nbsp; № 48",
			"name": "91, 92, 93, 94, 95",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.948586,
			"lat": 57.653755,
			"desc": "проезд Доброхотова, д.8 школа № 84",
			"name": "96, 97, 98",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.955334,
			"lat": 57.652813,
			"desc": "улица Серго Орджоникидзе, д.35а школа № 59",
			"name": "99, 100, 101, 102",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.958961,
			"lat": 57.649277,
			"desc": "Школьный проезд, д.13 школа № 79",
			"name": "103, 104, 105, 106",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.958595,
			"lat": 57.648411,
			"desc": "Школьный проезд, д.15 школа № 83",
			"name": "107, 108, 109",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.929638,
			"lat": 57.655567,
			"desc": "улица Алмазная, д.25 школа № 19",
			"name": "110, 111",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.830524,
			"lat": 57.721828,
			"desc": " улица Панфилова, д.9а школа&nbsp; № 67",
			"name": "112, 113",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.833241,
			"lat": 57.724346,
			"desc": "улица Лебедева, д.3а школа № 69",
			"name": "114, 115",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.81694,
			"lat": 57.727493,
			"desc": " улица Спартаковская, д.7 Дом культуры \"Гамма\"",
			"name": "116, 117",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.821438,
			"lat": 57.729458,
			"desc": "улица Комарова, д.1а школа № 77",
			"name": "118",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.80574,
			"lat": 57.753925,
			"desc": "улица Колышкина, д.46 школа № 41",
			"name": "119",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.816288,
			"lat": 57.72916,
			"desc": "ул.Здоровья, д.5 стационар больницы № 7",
			"name": "120",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.939144,
			"lat": 57.629925,
			"desc": "ул.Маяковского, д.61 медсанчасти Ярославского завода дизельной аппаратуры",
			"name": "121",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.968746,
			"lat": 57.656792,
			"desc": "ул.Яковлевская, д.7 стационар областной клинической больницы ",
			"name": "122",
			"tikName": "Заволжский"
		},
		{
			"lon": 39.896164,
			"lat": 57.624275,
			"desc": "ул. Революционная, д. 5 ФГБОУ ВПО «Ярославская государственная медицинская академия»",
			"name": "123",
			"tikName": "Кировский"
		},
		{
			"lon": 39.893791,
			"lat": 57.629124,
			"desc": "ул. Волкова, д. 5 МОУ СОШ № 4",
			"name": "124",
			"tikName": "Кировский"
		},
		{
			"lon": 39.886688,
			"lat": 57.633064,
			"desc": "ул. Советская, д. 14 ФГБОУ ВПО «Ярославский государственный университет им. П.Г. Демидова»",
			"name": "125",
			"tikName": "Кировский"
		},
		{
			"lon": 39.887611,
			"lat": 57.635475,
			"desc": "ул. Терешковой, д. 20 МОУ СОШ № 70",
			"name": "126",
			"tikName": "Кировский"
		},
		{
			"lon": 39.875618,
			"lat": 57.63345,
			"desc": "ул. Чайковского, д. 55 ЭГОУ СПО «Ярославский градостроительный колледж»",
			"name": "127",
			"tikName": "Кировский"
		},
		{
			"lon": 39.879734,
			"lat": 57.631783,
			"desc": "ул. Республиканская, д. 42 Академия Пастухова",
			"name": "128,129",
			"tikName": "Кировский"
		},
		{
			"lon": 39.881573,
			"lat": 57.628033,
			"desc": "ул. Собинова, д. 22 школа №33",
			"name": "130",
			"tikName": "Кировский"
		},
		{
			"lon": 39.880016,
			"lat": 57.625191,
			"desc": "ул. Свободы, д. 15 Городской выставочный зал им. Н.А. Нужина",
			"name": "131",
			"tikName": "Кировский"
		},
		{
			"lon": 39.876831,
			"lat": 57.622292,
			"desc": "ул. Республиканская, д. 108 ФГБОУ ВПО «Ярославский государственный педагогический университет им. К.Д. Ушинского",
			"name": "132",
			"tikName": "Кировский"
		},
		{
			"lon": 39.87381,
			"lat": 57.622013,
			"desc": "ул. Б. Октябрьская, д. 64а школа №43",
			"name": "133",
			"tikName": "Кировский"
		},
		{
			"lon": 39.869202,
			"lat": 57.626053,
			"desc": "ул. Свободы, д. 46 ГКЗ МУП «Старый город»",
			"name": "134",
			"tikName": "Кировский"
		},
		{
			"lon": 39.867645,
			"lat": 57.624088,
			"desc": "ул. Победы, д. 46 школа №7",
			"name": "135",
			"tikName": "Кировский"
		},
		{
			"lon": 39.815483,
			"lat": 57.628677,
			"desc": "ул. Салтыкова-Щедрина, д. 42а школа №42",
			"name": "136",
			"tikName": "Кировский"
		},
		{
			"lon": 39.86227,
			"lat": 57.627232,
			"desc": "ул. Угличская, д. 1/51 МОУ ДОД Специализированная ДЮСШ олимпийского резерва № 16",
			"name": "137",
			"tikName": "Кировский"
		},
		{
			"lon": 39.860168,
			"lat": 57.625942,
			"desc": "ул. Свободы, д. 77 школа №49",
			"name": "138, 139",
			"tikName": "Кировский"
		},
		{
			"lon": 39.857014,
			"lat": 57.620319,
			"desc": "ул. Б.Октябрьская, д. 79 МОУ СОШ «Провинциальный колледж»",
			"name": "140, 141",
			"tikName": "Кировский"
		},
		{
			"lon": 39.851768,
			"lat": 57.62302,
			"desc": "ул. Салтыкова-Щедрина, д. 75 школа №1",
			"name": "142, 143",
			"tikName": "Кировский"
		},
		{
			"lon": 39.850513,
			"lat": 57.624485,
			"desc": "ул. Рыбинская, д. 51 ДК ВОС",
			"name": "144, 145",
			"tikName": "Кировский"
		},
		{
			"lon": 39.843323,
			"lat": 57.629562,
			"desc": " ул. Угличская, д. 27 школа&nbsp; №25",
			"name": "146",
			"tikName": "Кировский"
		},
		{
			"lon": 39.836166,
			"lat": 57.627102,
			"desc": " ул. Павлика Морозова, д. 3 ДК и техники железнодорожников",
			"name": "147, 148",
			"tikName": "Кировский"
		},
		{
			"lon": 39.835579,
			"lat": 57.625839,
			"desc": "Привокзальная пл., д. 1а",
			"name": "149",
			"tikName": "Кировский"
		},
		{
			"lon": 39.788254,
			"lat": 57.639091,
			"desc": " ул. Магистральная, д. 50",
			"name": "150",
			"tikName": "Кировский"
		},
		{
			"lon": 39.886803,
			"lat": 57.636105,
			"desc": "ул. Терешковой, д. 22 Клиническая больница № 5",
			"name": "151",
			"tikName": "Кировский"
		},
		{
			"lon": 39.849697,
			"lat": 57.580898,
			"desc": "Московский проспект, д.92 МАУ «Дворец культуры «Нефтяник»",
			"name": "152, 153",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.849159,
			"lat": 57.582211,
			"desc": "ул.Курчатова д.3 КСЦ ОАО «Ярнефтехимстрой",
			"name": "154",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.842236,
			"lat": 57.57851,
			"desc": "ул. Рыкачева д.1 школа №75",
			"name": "155",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.84008,
			"lat": 57.581787,
			"desc": "ул.Зелинского, д. 6 лицей №86",
			"name": "156",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.828606,
			"lat": 57.583782,
			"desc": "ул. Нефтяников д.26 школа №31",
			"name": "157, 158, 159",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.833981,
			"lat": 57.58794,
			"desc": "ул. Павлова, д.37 школа №15",
			"name": "160, 161",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.836609,
			"lat": 57.589119,
			"desc": "ул.Павлова, д.6 «Профессиональное училище № 24",
			"name": "162, 163",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.8549,
			"lat": 57.585274,
			"desc": "Московский проспект, д.88 Ярославский государственный технический университет",
			"name": "164",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.844254,
			"lat": 57.588505,
			"desc": "ул.Гагарина д.12 МКУЗ «Медсанчасть НЯ НПЗ",
			"name": "165",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.878387,
			"lat": 57.605591,
			"desc": "Московский проспект, д.28 клуб ЯВЗРУ ПВО",
			"name": "166",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.868378,
			"lat": 57.60981,
			"desc": "ул.Б.Федоровская, д.62, школа №53",
			"name": "167, 168",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.840977,
			"lat": 57.603073,
			"desc": "ул.Лесная д. 12 школа №32",
			"name": "169",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.834732,
			"lat": 57.608631,
			"desc": "ул.Стачек, д.53 «Дом культуры «Красный Перекоп",
			"name": "170, 171",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.827694,
			"lat": 57.605335,
			"desc": "ул. Маланова д.10 школа №13",
			"name": "172, 173",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.824162,
			"lat": 57.602646,
			"desc": " ул.Маланова,&nbsp; д. 14 Ярославский индустриально-педагогический колледж",
			"name": "174",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.821869,
			"lat": 57.608646,
			"desc": "ул.Бахвалова, д.1г общежитие МУ «Ярославльобщежитие»",
			"name": "175",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.81871,
			"lat": 57.609028,
			"desc": "ул.Бахвалова, д. 3 школа №8",
			"name": "176, 177",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.829121,
			"lat": 57.608692,
			"desc": " ул.Семашко д.7 Городская больница имени Н.А. Семашко",
			"name": "178",
			"tikName": "Красноперекопский"
		},
		{
			"lon": 39.878483,
			"lat": 57.639095,
			"desc": "ул. Советская, 68 Государственный архив Ярославской области",
			"name": "179",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.873528,
			"lat": 57.640472,
			"desc": "ул. Советская, 71 школа №57",
			"name": "180",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.867195,
			"lat": 57.636208,
			"desc": "пр. Ленина, 27 Дворец Молодежи",
			"name": "181, 182",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.866615,
			"lat": 57.631004,
			"desc": "ул. Свердлова, 62 школа №71",
			"name": "183",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.8493,
			"lat": 57.633247,
			"desc": "ул. Тургенева, 14 школа №74",
			"name": "184",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.859161,
			"lat": 57.634174,
			"desc": "пр. Ленина, 24а Дворец культуры им. А.М. Добрынина",
			"name": "185, 186",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.855164,
			"lat": 57.633808,
			"desc": "ул. Щапова, 14 школа №36",
			"name": "187, 188",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.841866,
			"lat": 57.638176,
			"desc": "ул. Чкалова, 26 школа №9",
			"name": "189,190",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.840252,
			"lat": 57.635574,
			"desc": "ул. Кудрявцева, 28 Дом культуры \"Строитель\"",
			"name": "191, 192, 193",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.818306,
			"lat": 57.634445,
			"desc": "ул. Угличская, 60 школа №30",
			"name": "194, 195, 196, 197",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.813599,
			"lat": 57.640717,
			"desc": "ул. Юности, 15 школа №20",
			"name": "198-199",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.819824,
			"lat": 57.641033,
			"desc": "ул. Автозаводская, 69д школа №76",
			"name": "200, 201, 202",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.830021,
			"lat": 57.64114,
			"desc": "ул. Жукова, 7а школа №3",
			"name": "203, 204",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.837196,
			"lat": 57.637943,
			"desc": "ул. Чкалова, 34 лицей №10",
			"name": "205",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.838001,
			"lat": 57.631634,
			"desc": "ул. Угличская, 40 Ярославский областной клинический госпиталь ветеранов войн",
			"name": "206",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.864674,
			"lat": 57.63966,
			"desc": "ул. Загородный сад, 11 ГУЗ ЯО клиническая больница скорой медицинской помощи им. Н.В. Соловьева",
			"name": "207",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.861057,
			"lat": 57.637562,
			"desc": "пр. Октября, 54 инфекционная клиническая больница № 1",
			"name": "208",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.860523,
			"lat": 57.636539,
			"desc": "пр. Октября, 59 Ярославская областная клиническая наркологическая больница",
			"name": "209",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.855232,
			"lat": 57.640102,
			"desc": "пр. Октября, 67 клиническая онкологическая больница",
			"name": "210",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.861797,
			"lat": 57.6362,
			"desc": "пр. Октября, 52 ГУЗ ЯО МСЧ ОАО «ЯШЗ»",
			"name": "211",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.865749,
			"lat": 57.639194,
			"desc": " ул. Загородный сад, 6 Ярославская областная клиническая психиатрическая больница",
			"name": "212",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.843216,
			"lat": 57.632759,
			"desc": "ул. Чехова, 34 «Дорожная клиническая больница на станции Ярославль ОАО «РЖД»",
			"name": "213",
			"tikName": "Ленинский"
		},
		{
			"lon": 39.895348,
			"lat": 57.610302,
			"desc": "ул. Туговская, 11 школа №16",
			"name": "214",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.90942,
			"lat": 57.609283,
			"desc": "ул. Портовая наб., д. 10, ФКУ СИЗО-1 УФСИН России по Ярославской области",
			"name": "215",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.894299,
			"lat": 57.606102,
			"desc": "2‑я Полянская Специальная коррекционная школа № 45 Фрунзенский",
			"name": "216",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.883343,
			"lat": 57.604397,
			"desc": "ул.Верхняя, 5а школа №22",
			"name": "217",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.914715,
			"lat": 57.598602,
			"desc": "ул.2‑я Портовая, 1 Ярославский речной порт",
			"name": "218",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.919617,
			"lat": 57.579578,
			"desc": "ул.Ильинская, 14 школа №21",
			"name": "219, 220, 221",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.924026,
			"lat": 57.575165,
			"desc": "ул. Театральная, 21 ДК “Судостроитель",
			"name": "222, 223, 224",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.927647,
			"lat": 57.572441,
			"desc": "ул.Спортивная, 4 Детская школа искусств им. Е.М.Стомпелева",
			"name": "225",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.929058,
			"lat": 57.56953,
			"desc": "ул.Светлая, 36 школа №23",
			"name": "226, 227",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.932922,
			"lat": 57.566593,
			"desc": "пр. Фрунзе, 75а школа №89",
			"name": "228, 229",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.955032,
			"lat": 57.556244,
			"desc": "пос.Октябрьский, 19 Профессиональный лицей № 18",
			"name": "230",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.979397,
			"lat": 57.54343,
			"desc": "пос. Прибрежный, 25, ОАО «81‑я ЦИБ»",
			"name": "231",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.945274,
			"lat": 57.553238,
			"desc": "ул. Щепкина, 10 МОУДО ДЮЦ «Молния",
			"name": "232",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.938892,
			"lat": 57.551636,
			"desc": "ул. Щепкина, 8 МУК ДК “Радий",
			"name": "233, 234",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.937008,
			"lat": 57.550358,
			"desc": "Индустриальный пер., 10 школа №73",
			"name": "235",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.932804,
			"lat": 57.553108,
			"desc": "ул. Пирогова, 12 школа №78",
			"name": "236",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.922867,
			"lat": 57.559357,
			"desc": "ул. Звездная, 11 школа №88",
			"name": "237, 238",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.875397,
			"lat": 57.583473,
			"desc": "ул. Кривова, 4 школа №35",
			"name": "239, 248, 249",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.878628,
			"lat": 57.601685,
			"desc": "Суздальское шоссе, 1 ДК «Магистраль",
			"name": "240",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.878975,
			"lat": 57.597527,
			"desc": "Суздальское шоссе,15 школа №66",
			"name": "241",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.879818,
			"lat": 57.598549,
			"desc": "проспект Фрунзе, 8 профессиональное училище № 5",
			"name": "242",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.869652,
			"lat": 57.59264,
			"desc": "ул. Гоголя, д. 7 школа №14",
			"name": "243, 244, 245",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.857861,
			"lat": 57.585995,
			"desc": "Московский пр., 151 Ярославский железнодорожный техникум -филиал МИИТ",
			"name": "246, 247",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.85495,
			"lat": 57.583038,
			"desc": "Московский пр., 155 ДОД Дом детского творчества Фрунзенского района",
			"name": "250",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.859032,
			"lat": 57.580769,
			"desc": "ул. Слепнева, 26 школа №18",
			"name": "251, 252",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.85046,
			"lat": 57.576839,
			"desc": "пр-д Подвойского, 11 школа №6",
			"name": "253, 254",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.863815,
			"lat": 57.578911,
			"desc": "ул. Слепнева, 14Б Университетский колледж Ярославского государственного университета им. Демидова",
			"name": "255",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.864094,
			"lat": 57.578266,
			"desc": " ул. Слепнева, 14а Специализированная детско-юношеская спортивная школа олимпийского резерва № 10",
			"name": "256",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.852337,
			"lat": 57.574829,
			"desc": "пр-д Ушакова, 11 гимназия №1",
			"name": "257, 258",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.85709,
			"lat": 57.574299,
			"desc": "пр-д Матросова, 9 учебный корпус Ярославского государственного университета имени Демидова",
			"name": "259, 260",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.866455,
			"lat": 57.571339,
			"desc": "ул. Калинина, 35а школа №28",
			"name": "261, 262, 266",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.868153,
			"lat": 57.5704,
			"desc": "ул. Калинина, 37а школа №68",
			"name": "263, 264, 265",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.930367,
			"lat": 57.56078,
			"desc": "ул. Попова, 24 Клиническая больница № 2",
			"name": "267",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.878933,
			"lat": 57.589027,
			"desc": "Суздальское шоссе, 39 Клиническая больница № 8",
			"name": "268",
			"tikName": "Фрунзенский"
		},
		{
			"lon": 39.87991,
			"lat": 57.595039,
			"desc": "Суздальское шоссе, 21 Дорожная клиническая больница на станции Ярославль ОАО «РЖД»",
			"name": "269",
			"tikName": "Фрунзенский"
		}
	],
	"kv": [
		{
			"lon": 39.840923,
			"lat": 57.584103,
			"desc": "Ярославль, Ярославская область",
			"name": "ул. Гагарина, 41"
		},
		{
			"lon": 39.857578,
			"lat": 57.57814,
			"desc": "Ярославль, Ярославская область",
			"name": "пр. Ушакова, 2/14"
		},
		{
			"lon": 39.882496,
			"lat": 57.632435,
			"desc": "Ярославль, Ярославская область",
			"name": "просп. Октября, 11"
		},
		{
			"lon": 39.831348,
			"lat": 57.583611,
			"desc": "Ярославль, Ярославская область",
			"name": "ул. Титова, 16 корпус 2"
		},
/*		{
			"lon": 39.852219,
			"lat": 57.623798,
			"desc": "Ярославль, Ярославская область",
			"name": "ул. Салтыкова-Щедрина, 84"
		},*/
		{
			"lon": 39.887833,
			"lat": 57.628876,
			"name": "Ибис Ярославль Центр"
		},
		{
			"lon": 39.836571,
			"lat": 57.587296,
			"desc": "Ярославль, Ярославская область",
			"name": "ул. Павлова, 33"
		},
		{
			"lon": 39.831352,
			"lat": 57.583618,
			"desc": "Ярославль, Ярославская область",
			"name": "ул. Титова, 16"
		},
		{
			"lon": 39.8592436,
			"lat": 57.62999945,
			"desc": "Ярославль, Ярославская область",
			"name": "просп. Толбухина, 62"
		},
		{
			"lon": 39.838135,
			"lat": 57.579803,
			"desc": "Ярославль, Ярославская область",
			"name": "ул. Нефтяников, 12"
		},
		{
			"lon": 39.8261336,
			"lat": 57.58439145,
			"desc": "Ярославль, Ярославская область",
			"name": "ул. Нефтяников, 32"
		},
		{
			"lon": 39.823532,
			"lat": 57.604774,
			"desc": "Ярославль, Ярославская область",
			"name": "ул. 8 Марта, 13 корпус 2"
		},
		{
			"lon": 39.81940545,
			"lat": 57.6366145,
			"desc": "Ярославль, Ярославская область",
			"name": "ул. Первая Жилая 12, к. 2"
		},
		{
			"lon": 39.8835805,
			"lat": 57.62105655,
			"desc": "Которосльная набережная, д. 26",
			"name": "гостиница Юбилейная"
		},
		{
			"lon": 39.8616673,
			"lat": 57.62967195,
			"desc": "Ярославль, Ярославская область",
			"name": "Богдановича, 6"
		}
	],
	"food": [
		{
			"lon": 39.88193135,
			"lat": 57.6260216,
			"desc": "ул. Собинова, 33",
			"name": "Дудки"
		},
		{
			"lon": 39.87820505,
			"lat": 57.62507195,
			"desc": "ул. Республиканская, 73",
			"name": "Этажи"
		},
		{
			"lon": 39.88937955,
			"lat": 57.62438535,
			"desc": "ул. Депутатская, 7",
			"name": "Бар Rocks"
		},
		{
			"lon": 39.79109055,
			"lat": 57.67933005,
			"desc": "Ленинградский пр., 49А",
			"name": "Свои да наши (ТЦ Космос)"
		},
		{
			"lon": 39.8690906,
			"lat": 57.62571565,
			"desc": "ул. Свободы, 59",
			"name": "Макдональдс"
		},
		{
			"lon": 39.8747643,
			"lat": 57.5994733,
			"desc": "Московский пр-т , 105",
			"name": "Макдональдс"
		},
		{
			"lon": 39.76999235,
			"lat": 57.69289425,
			"desc": "Ленинградский пр-т, 109",
			"name": "Макдональдс"
		},
		{
			"lon": 39.9421797,
			"lat": 57.6540467,
			"desc": "ул. Авиаторов, 88а",
			"name": "Макдональдс"
		},
		{
			"lon": 39.86350575,
			"lat": 57.62603665,
			"desc": "ул. Свободы, 71",
			"name": "Фрекен бок"
		},
		{
			"lon": 39.8523419,
			"lat": 57.62640735,
			"desc": "ул. Свободы, 87а",
			"name": "Пиццерия Академия"
		},
		{
			"lon": 39.8965646,
			"lat": 57.6244734,
			"desc": "ул. Революционная, 5",
			"name": "Пиццерия Академия"
		},
		{
			"lon": 39.883577125,
			"lat": 57.639545975,
			"desc": "ул. Республиканская, д. 3",
			"name": "Пиццерия Академия"
		},
		{
			"lon": 39.8849250,
			"lat": 57.6249172,
			"desc": "ул. Комсомольская, д. 3",
			"name": "Пиццерия Мама Мия"
		},
		{
			"lon": 39.8501901,
			"lat": 57.6373472,
			"desc": "ул. Чкалова, 1б",
			"name": "Гриль-бар Ярбург"
		}
	]
	},
	ikMetadata = [
		{
			"type": "УИКи",
			"pict": "images/Red-chair32.png",
			"classifier": "tikName",
			"popupTpl": "<strong>УИК {name}</strong><br/>{desc}",
			"data": ikData.uiks
		},
		{
			"type": "ТИКи",
			"pict": "images/Red-Couch32.png",
			"popupTpl": "<strong>ТИК <a href='{url}'>{name}</a></strong><br/>{desc}",
			"data": ikData.tiks
		},
		{
			"type": "Жильё",
			"pict": "images/House32.png",
			"popupTpl": "<strong>{name}</strong>",
			"data": ikData.kv
		},
		{
			"type": "Можно вкусно поесть",
			"pict": "images/Coffee32.png",
			"popupTpl": "<strong>{name}</strong><br/>{desc}",
			"data": ikData.food
		}
	];

var getMapYarCentered = function() {
	var map = new L.Map('map');
	var cloudmade = new L.TileLayer('http://{s}.tile.cloudmade.com/4dbea02acb2d47779913c727fa16dda9/997/256/{z}/{x}/{y}.png',
		{
			attribution: 'Map data &copy; <a href="http://openstreetmap.org">OpenStreetMap</a> contributors, <a href="http://creativecommons.org/licenses/by-sa/2.0/">CC-BY-SA</a>, Imagery © <a href="http://cloudmade.com">CloudMade</a>',
			maxZoom: 18
		}
	);
	var yar = new L.LatLng(57.616666676667, 39.85000001);
	map.setView(yar, 13).addLayer(cloudmade);
	return map;
};
var tpl = function(templ, obj) {
	return templ.replace(/{([^}]+)}/g, function(a, b) {
		return obj[b];
	});
};
var createMap = function() {
	var map = getMapYarCentered(),
		IkIcon = L.Icon.extend({
			iconSize: new L.Point(32, 32)
		}),
		subLayers = {},
		groupIcon,
		lGroup,
		markerPlace,
		marker,
		arr,
		overlays = {};

	for (var i = 0, len = ikMetadata.length; i < len; i++) {
		groupIcon = new IkIcon(ikMetadata[i].pict);
		lGroup = new L.LayerGroup();
		arr = ikMetadata[i].data;
		for (var j = 0, leng = arr.length; j < leng; j++) {
			markerPlace = new L.LatLng(arr[j].lat, arr[j].lon);
			marker = new L.Marker(markerPlace, {icon: groupIcon});
			marker.bindPopup(tpl(ikMetadata[i].popupTpl, arr[j]));
			if (typeof ikMetadata[i].classifier == 'undefined') {
				lGroup.addLayer(marker);
			} else {
				if (!subLayers[arr[j][ikMetadata[i].classifier]]) {
					subLayers[arr[j][ikMetadata[i].classifier]] = new L.LayerGroup;
				}
				subLayers[arr[j][ikMetadata[i].classifier]].addLayer(marker);
			}
		}
		if (typeof ikMetadata[i].classifier == 'undefined') {
			overlays[ikMetadata[i].type] = lGroup;
		} else {
			for (var prop in subLayers) {
				lGroup.addLayer(subLayers[prop]);
				overlays[ikMetadata[i].type + ' (' + prop + ')'] = subLayers[prop];
			}
		}
		map.addLayer(lGroup);
	}

	var layersControl = new L.Control.Layers({}, overlays);

	map.addControl(layersControl);
};
window.onload = createMap;
})();
